backend/tests/performance/artillery-load-test.yml
# Artillery Load Testing Configuration
# Tests: NFR-2.2 (Scalability - 100 concurrent users)
# 
# Install: npm install -g artillery
# Run: artillery run artillery-load-test.yml
# Generate report: artillery run --output report.json artillery-load-test.yml && artillery report report.json

config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase: gradually increase load
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    
    # Load test phase: simulate 100 concurrent users
    - duration: 120
      arrivalRate: 50
      name: "Sustained load - 100 users"
    
    # Stress test phase: push to limits
    - duration: 60
      arrivalRate: 100
      name: "Peak load - 200 users"
    
    # Cool down phase
    - duration: 30
      arrivalRate: 10
      name: "Cool down"
  
  # Performance thresholds (NFR-2.1: < 3 seconds)
  ensure:
    maxErrorRate: 1  # Max 1% error rate
    p95: 3000        # 95% of requests under 3 seconds
    p99: 5000        # 99% of requests under 5 seconds

scenarios:
  # Scenario 1: Browse jobs (most common user action)
  - name: "Browse Jobs"
    weight: 40
    flow:
      - post:
          url: "/api/job/list"
          json:
            page: 1
            pageSize: 20
          headers:
            Authorization: "Bearer test-token-placeholder"
          capture:
            - json: "$.data.items[0].id"
              as: "jobId"
      
      - get:
          url: "/api/job/{{ jobId }}"
          headers:
            Authorization: "Bearer test-token-placeholder"
  
  # Scenario 2: User authentication
  - name: "Login Flow"
    weight: 20
    flow:
      - post:
          url: "/api/login"
          json:
            email: "testuser@ku.th"
            password: "TestPassword123"
  
  # Scenario 3: View dashboard
  - name: "View Dashboard"
    weight: 25
    flow:
      - get:
          url: "/api/profile/dashboard"
          headers:
            Authorization: "Bearer test-token-placeholder"
  
  # Scenario 4: Search with filters
  - name: "Advanced Search"
    weight: 15
    flow:
      - post:
          url: "/api/job/list"
          json:
            page: 1
            pageSize: 20
            filters:
              location: "Bangkok"
              jobType: "full-time"
              minSalary: 30000
          headers:
            Authorization: "Bearer test-token-placeholder"